# 4. Transform the Data
 
> "What is measured may not help answer what is needed"

- **Convert** e.g. free text to coded value
- **Calculate** e.g. percentages, proportion
- **Merge** e.g. first and surname for full name
- **Aggregate** e.g. rollup by year, cluster by area
- **Filter** e.g. exclude based on location
- **Sample** e.g. extract a representative data
- **Summary** e.g. show summary stats like mean

## Let us read the data

In [41]:
# Import the library we need, which is Pandas
import pandas as pd

You will find the variable `df` used quite often to store a `dataframe`

In [42]:
# Read the csv file of Monthwise Quantity and Price csv file we have.
df = pd.read_csv('MonthWiseMarketArrivals_clean.csv')

## Understand Data Structure and Types

In [43]:
df.shape

(11682, 10)

In [44]:
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,January-2005
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,January-2006
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,January-2010
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,January-2011
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,January-2012

### Data Structure

So we have ten columns in our dataset. Let us understand what each one is.

Three are about the location of the Wholesale Market where Onion where sold.
- **state**: This is the 2 letter abbreviation for the state in India (PB is Punjab and so on)
- **city**: This is the city in India (ABOHAR, BANGALORE and so on)
- **market**: This is a string with the combination of the state and city

Three are related to the 
- **month**: Month in January, February and so on. 
- **year**: Year in YYYY representastion
- **date**: The combination of the two above.

Four are about quantity and price in these wholesale market. 
- **quantity**: The quanity of Onion arriving in the market in that month in quintals (100 kg)
- **priceMin**: The minimum price in the month in Rs./quintal
- **priceMax**: The maximum price in the month in Rs./quintal
- **priceMod**: The modal price in the month in Rs./quintal

We would expect the following the columns to be of the following type
- **CATEGORICAL**: state, city, market
- **TIME INTERVAL**: month, year, date
- **QUANTITATIVE**: quantity, priceMin, priceMax, priceModal

Let us see what pandas dataframe is reading these columns as.

In [45]:
# Get the typeof each column
df.dtypes

market      object
month       object
year         int64
quantity     int64
priceMin     int64
priceMax     int64
priceMod     int64
state       object
city        object
date        object
dtype: object

So we are getting the quantitive columns are correctly being shown as integers and the categorical columns are showing as objects(strings) which is fine. 
However, the `date` columns is being read as an object and not a Time-Interval. Let us at least fix the `date` column and make it into a datetime object

In [46]:
# Changing the date column to a Time Interval columnn
df.date = pd.DatetimeIndex(df.date)

In [47]:
df.shape

(11682, 10)

In [48]:
# Now checking for type of each column
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

In [49]:
# Let us see the dataframe again now
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,2005-01-01
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,2006-01-01
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,2010-01-01
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,2011-01-01
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01

### Exercise

Find the starting date for the database?

In [50]:
df.date.min()

Timestamp('1996-01-01 00:00:00')

Find the maximum quantity of Onion sold in a month?

In [51]:
df.quantity.max()

1974018

Find the maximum and minimum Price for Onion in India?

In [52]:
df.priceMax.max()

12000

In [53]:
df.priceMin.min()

16

Find the number of unique cities and states in this database?

In [54]:
len(df.state.unique())

23

## Question 1 - How big is the Bangalore & Delhi onion market compared to other cities in India?

Let us try to do this examination for one of the year only. So we want to reduce our dataframe for only where the year = 2016. This process is called subset.

### PRINCIPLE: Subset a Dataframe

![](../img/subsetrows.png)

How do you subset a dataframe on a given criteria

`newDataframe` = `df`[ <`subset condition`> ]

In [55]:
df2016 = df[df.year == 2016]

In [56]:
df2016.head(10)

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
48,ABOHAR(PB),June,2016,710,523,755,613,PB,ABOHAR,2016-06-01
64,ABOHAR(PB),August,2016,60,650,1065,850,PB,ABOHAR,2016-08-01
72,ABOHAR(PB),September,2016,400,650,800,725,PB,ABOHAR,2016-09-01
80,ABOHAR(PB),October,2016,350,700,900,850,PB,ABOHAR,2016-10-01
88,ABOHAR(PB),November,2016,590,775,1059,888,PB,ABOHAR,2016-11-01
96,ABOHAR(PB),December,2016,330,688,1100,873,PB,ABOHAR,2016-12-01
108,AGRA(UP),January,2016,134200,1039,1443,1349,UP,AGRA,2016-01-01
121,AGRA(UP),February,2016,124508,895,1220,1130,UP,AGRA,2016-02-01
132,AGRA(UP),March,2016,120500,750,1085,1011,UP,AGRA,2016-03-01
144,AGRA(UP),April,2016,99700,697,1020,957,UP,AGRA,2016-04-01

In [57]:
# We can also subset on multiple criterias
df2016Bang = df[(df.year == 2016) & (df.city == 'BANGALORE')]

In [58]:
df2016Bang

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date
859,BANGALORE,January,2016,507223,200,1943,1448,KT,BANGALORE,2016-01-01
873,BANGALORE,February,2016,465640,200,1426,1027,KT,BANGALORE,2016-02-01
886,BANGALORE,March,2016,444696,200,1075,750,KT,BANGALORE,2016-03-01
899,BANGALORE,April,2016,426567,200,1102,753,KT,BANGALORE,2016-04-01
912,BANGALORE,May,2016,465936,218,1111,803,KT,BANGALORE,2016-05-01
925,BANGALORE,June,2016,418794,187,1276,903,KT,BANGALORE,2016-06-01
938,BANGALORE,July,2016,452828,200,1272,985,KT,BANGALORE,2016-07-01
951,BANGALORE,August,2016,562522,200,1208,897,KT,BANGALORE,2016-08-01
964,BANGALORE,September,2016,831895,195,1048,758,KT,BANGALORE,2016-09-01
977,BANGALORE,October,2016,1620273,216,1103,680,KT,BANGALORE,2016-10-01
990,BANGALORE,November,2016,1974018,196,1465,881,KT,BANGALORE,2016-11-01
1003,BANGALORE,December,2016,947081,192,1315,875,KT,BANGALORE,2016-12-01

### Exercise

Subset the dataframe for Delhi in 2016.

Find the city with the highest onion quantity sold?

###  Principle: Split Apply Combine

How do we get the sum of quantity for each city.

We need to **SPLIT** the data by each city, **APPLY** the sum to the quantity row and then **COMBINE** the data again


![](../img/splitapplycombine.png)


In pandas, we use the `groupby` function to do this.

In [62]:
df2016.groupby(['city']).quantity.sum().head()

city
ABOHAR                2440
AGRA               1348878
AHMEDABAD          2110393
AHMEDNAGAR         1289549
AIGINIA MANDIA       53550
Name: quantity, dtype: int64

In [63]:
# Group by using city
df2016City = df2016.groupby(['city']).sum()

In [64]:
df2016City.head()

                  year  quantity  priceMin  priceMax  priceMod
city
ABOHAR           12096      2440      3986      5679      4799
AGRA             24192   1348878     10239     13570     12182
AHMEDABAD        24192   2110393      5483     11405      8812
AHMEDNAGAR       22176   1289549      1451     13610      9084
AIGINIA MANDIA   10080     53550      5540      6529      6029

In [65]:
type(df2016City)

pandas.core.frame.DataFrame

In [66]:
# If we only want to apply the sum function on quantity, then we specify the quantity column
df2016City = df2016.groupby(['city']).quantity.sum()

In [67]:
# Let us see this dataframe
df2016City.head()

city
ABOHAR                2440
AGRA               1348878
AHMEDABAD          2110393
AHMEDNAGAR         1289549
AIGINIA MANDIA       53550
Name: quantity, dtype: int64

In [68]:
# To create a dataframe again, it is best to specify index as false
df2016City = df2016.groupby(['city'], as_index=False).quantity.sum()

In [69]:
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

In [70]:
df2016City.head()

              city  quantity
0           ABOHAR      2440
1             AGRA   1348878
2        AHMEDABAD   2110393
3       AHMEDNAGAR   1289549
4  AIGINIA MANDIA      53550

In [71]:
df.dtypes

market              object
month               object
year                 int64
quantity             int64
priceMin             int64
priceMax             int64
priceMod             int64
state               object
city                object
date        datetime64[ns]
dtype: object

### PRINCIPLE: Sorting

In [72]:
# Sort the Dataframe by Quantity to see which one is on top
df2016City = df2016City.sort_values(by = "quantity")
df2016City.head()

             city  quantity
156  SRINIVASPUR         70
32         CHALA        130
46          DEWAS       237
10          ANGUL       490
119    PALAMANER        500

In [73]:
df2016City = df2016City.sort_values(by = "quantity", ascending = False)
df2016City.head()

           city  quantity
15    BANGALORE   9117473
102      MAHUVA   6144573
126  PIMPALGAON   3836046
154     SOLAPUR   3767140
129        PUNE   3493535

### Exercise

Find the top 10 city with highest average monthly sales in the last 5 years (from 2012 to 2016)?

In [78]:
df2016Till2012 = df[(df.year > 2011) & (df.year < 2017)]
df2016Till2012.groupby(['city']).quantity.mean().sort_values(ascending=False).head(10)

city
BANGALORE     669581.583333
MAHUVA        371856.694915
SOLAPUR       332377.816667
PUNE          296490.150000
DELHI         285956.700000
LASALGAON     280032.716667
PIMPALGAON    259157.966667
MUMBAI        224131.833333
BHAVNAGAR     190190.731707
NEWASA        188024.115385
Name: quantity, dtype: float64

In [79]:
df['value']=df.quantity * df.priceMod
df.head()

,market,month,year,quantity,priceMin,priceMax,priceMod,state,city,date,value
0,ABOHAR(PB),January,2005,2350,404,493,446,PB,ABOHAR,2005-01-01,1048100
1,ABOHAR(PB),January,2006,900,487,638,563,PB,ABOHAR,2006-01-01,506700
2,ABOHAR(PB),January,2010,790,1283,1592,1460,PB,ABOHAR,2010-01-01,1153400
3,ABOHAR(PB),January,2011,245,3067,3750,3433,PB,ABOHAR,2011-01-01,841085
4,ABOHAR(PB),January,2012,1035,523,686,605,PB,ABOHAR,2012-01-01,626175